mobilinkd/stm32l452ceu6-demo/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_DAC1_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_RNG_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM6_Init(void);
static void MX_CRC_Init(void);
static void MX_TIM2_Init(void);
void startDefaultTask(void const * argument);
extern void startAudioInputTask(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void startADC(void);
float* filter(int16_t* input);

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
long _write_r(struct _reent *r, int fd, const char *ptr, int len);

long _write_r(struct _reent *r, int fd, const char *ptr, int len)
{
  for (int i = 0; i != len; ++i)
    ITM_SendChar(ptr[i]);
  return len;
}

inline void adc_buffer_copy(int n)
{
  ITM_SendChar('0' + adc_counter);
  uint16_t* dest = adc_bounce_buffer + (ADC_BUFFER_SIZE * adc_counter);
  uint16_t* src = ((uint16_t*)adc_buffer) + (n * ADC_BUFFER_SIZE);
  memcpy(dest, src, ADC_BUFFER_SIZE * 2);
  adc_counter = ((adc_counter + 1) & (ADC_BLOCKS - 1));
  osMessagePut(adcInputQueueHandle, (uint32_t) dest, 0);
}

// DMA Conversion first half complete.
void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* unused)
{
  // ADC_STATUS_GPIO_Port->BRR = ADC_STATUS_Pin;
  ITM_SendChar('h');
  adc_buffer_copy(0);
}

// DMA Conversion second half complete.
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* unused)
{
  // ADC_STATUS_GPIO_Port->BSRR = ADC_STATUS_Pin;
  ITM_SendChar('c');
  adc_buffer_copy(1);
}

void startADC(void)
{
  HAL_StatusTypeDef adcStatus = HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
  if (adcStatus != HAL_OK) {
    Error_Handler();
  }

  HAL_TIM_Base_Start(&htim6);
  HAL_ADC_Start_DMA(&hadc1, adc_buffer, ADC_BUFFER_SIZE * 2);
}

void init_filter(void)
{
  arm_fir_init_f32(&instance, FILTER_SIZE, (float32_t*)filter_taps,
    filter_state, ADC_BUFFER_SIZE);
}

float* filter(int16_t* input)
{
  // HAL_GPIO_WritePin(FIR_STATUS_GPIO_Port, FIR_STATUS_Pin, GPIO_PIN_SET);
  for (size_t i = 0; i != ADC_BUFFER_SIZE; i++) {
      filter_input[i] = (input[i] - 16384) * 0.000061035f;
  }
  arm_fir_f32(&instance, filter_input, filter_output, ADC_BUFFER_SIZE);
  // HAL_GPIO_WritePin(FIR_STATUS_GPIO_Port, FIR_STATUS_Pin, GPIO_PIN_RESET);
  return filter_output;

}

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_DAC1_Init();
  MX_LPUART1_UART_Init();
  MX_RNG_Init();
  MX_RTC_Init();
  MX_TIM6_Init();
  MX_CRC_Init();
  MX_TIM2_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  osThreadStaticDef(defaultTask, startDefaultTask, osPriorityIdle, 0, 256, defaultTaskBuffer, &defaultTaskControlBlock);
  defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* definition and creation of audioInputTask */
  osThreadStaticDef(audioInputTask, startAudioInputTask, osPriorityAboveNormal, 0, 512, audioInputTaskBuffer, &audioInputTaskControlBlock);
  audioInputTaskHandle = osThreadCreate(osThread(audioInputTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Create the queue(s) */
  /* definition and creation of adcInputQueue */
  osMessageQStaticDef(adcInputQueue, 3, uint32_t, adcInputQueueBuffer, &adcInputQueueControlBlock);
  adcInputQueueHandle = osMessageCreate(osMessageQ(adcInputQueue), NULL);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */
 

  /* Start scheduler */
  osKernelStart();
  
  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI
                              |RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 2;
  RCC_OscInitStruct.PLL.PLLN = 20;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

